// Lesson10.cpp : Defines the entry point for the console application.
//

#include "stdafx.h"

// Повторение пройденного материала
/*
1)	Чем отличается обычный список от комбинированного списка?
2)	Какими способами можно создать список на диалоге?
3)	Какое сообщение придёт в диалоговую процедуру при выборе элемента списка?
4)	Какое уведомление от списка приходит родительскому окну (диалогу) при 
    изменении текущего выбора?
5)	Какие сообщения необходимо отправить списку для добавления, вставки 
    и удаления строки?
6)	Какое сообщение необходимо отправить списку для поиска в нём указанной строки?
7)	Какое сообщение необходимо отправить списку, чтобы определить индекс 
    выбранного элемента списка?
8)	Как программно выбрать элемент списка?
9)	Какое сообщение необходимо отправить списку, чтобы определить 
    количество элементов в нем?
10)	Какое сообщение необходимо отправить списку, чтобы его очистить?
11)	Какое сообщение необходимо отправить списку, чтобы получить текст 
    указанного элемента?
12)	Какая функция возвращает битовую маску логических дисков, 
    которые доступны в данный момент?
13)	Какая функция возвращает тип накопителя по заданному имени 
    корневого пути?
*/

// Распаковщики сообщений

// Общие элементы управления.

// Элемент управления «индикатор процесса»(Progress Control).

// Сообщения индикатора процесса.

// Практическая часть.

// Домашнее задание.


int main()
{
    return 0;
}

