// Lesson11.cpp : Defines the entry point for the console application.
//

#include "stdafx.h"


// Повторение пройденного материала
/*
1)	Что такое распаковщики сообщений? 
	Какими преимуществами они обладают?
2)	В чем состоит главное отличие общих элементов управления 
    от базовых элементов управления?
3)	Для чего применяется элемент управления Progress Control?
4)	Какое сообщение необходимо отправить индикатору, чтобы 
    установить ему интервал(нижнюю и верхнюю границу)?
5)	Какие макросы позволяют упаковать дополнительную информацию 
    в параметры WPARAM и LPARAM?
6)	С помощью какого сообщения можно установить шаг приращения для индикатора?
7)	Какими способами можно изменить текущее состояние индикатора?
8)	Как установить цвет фона индикатора?
9)	Как установить цвет самого индикатора(цвет заполняемых прямоугольников)?
10)	Как программно создать Progress Control?
*/

// Общий элемент управления «регулятор» (Slider Control)


// Общий элемент управления «счётчик» (Spin Control)


int main()
{
    return 0;
}

